<a href="https://colab.research.google.com/github/code-with-mohitpal/AI-ML-data-science-python/blob/main/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
a=pd.read_csv("/content/Data.csv")

In [ ]:
a.isnull().sum()

Country      0
Age          2
Salary       1
Purchased    0
dtype: int64

In [ ]:
z=a["Age"].dropna()
print(z)

0    44.0
1    27.0
3    38.0
4    40.0
5    35.0
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [ ]:
b=a["Age"].std()
z=a.fillna(b)
print(z)
z.to_csv("final.csv")

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany   7.434235  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000      7.434235       Yes
5   France  35.000000  58000.000000       Yes
6    Spain   7.434235  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [ ]:
print(a.shape)

(10, 4)

In [ ]:
print(a.columns)

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [ ]:
print(a.index)

RangeIndex(start=0, stop=10, step=1)

In [ ]:
print(a[["Age","Salary","Country"]])

    Age   Salary  Country
0  44.0  72000.0   France
1  27.0  48000.0    Spain
2   NaN  54000.0  Germany
3  38.0  61000.0    Spain
4  40.0      NaN  Germany
5  35.0  58000.0   France
6   NaN  52000.0    Spain
7  48.0  79000.0   France
8  50.0  83000.0  Germany
9  37.0  67000.0   France

In [ ]:

a["Salary"]>65000

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
9     True
Name: Salary, dtype: bool

In [ ]:
mean1=a["Salary"].max()
a["Salary"].fillna(mean1)

0    72000.0
1    48000.0
2    54000.0
3    61000.0
4    83000.0
5    58000.0
6    52000.0
7    79000.0
8    83000.0
9    67000.0
Name: Salary, dtype: float64

In [ ]:
a[a["Salary"]>80000]

   Country   Age   Salary Purchased
8  Germany  50.0  83000.0        No

In [ ]:
file = pd.read_csv("/content/Social_Network_Ads.csv")
print(file)

In [ ]:
file.isnull().sum()

User ID            6
Gender             4
Age                7
EstimatedSalary    7
Purchased          0
dtype: int64

In [ ]:
file.shape

(400, 5)

In [ ]:
file.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [ ]:
file.describe()

            User ID         Age  EstimatedSalary   Purchased
count  3.940000e+02  393.000000       393.000000  400.000000
mean   1.569089e+07   37.720102     69575.063613    0.357500
std    7.142480e+04   10.485073     34036.896083    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562492e+07   30.000000     43000.000000    0.000000
50%    1.569378e+07   37.000000     69000.000000    0.000000
75%    1.574989e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [ ]:
file.isnull()

     User ID  Gender    Age  EstimatedSalary  Purchased
0      False   False  False            False      False
1       True   False  False            False      False
2      False    True  False            False      False
3      False   False  False            False      False
4       True   False  False            False      False
..       ...     ...    ...              ...        ...
395    False   False  False            False      False
396    False   False  False            False      False
397    False   False  False            False      False
398    False   False  False            False      False
399    False   False  False            False      False

[400 rows x 5 columns]

In [ ]:
p = file["Age"].max()
file["Age"].fillna(p)

0      19.0
1      35.0
2      26.0
3      27.0
4      19.0
       ...
395    46.0
396    51.0
397    50.0
398    36.0
399    49.0
Name: Age, Length: 400, dtype: float64

In [ ]:
p = file["EstimatedSalary"].mean()
file["EstimatedSalary"].fillna(p)

0      19000.0
1      20000.0
2      43000.0
3      57000.0
4      76000.0
        ...
395    41000.0
396    23000.0
397    20000.0
398    33000.0
399    36000.0
Name: EstimatedSalary, Length: 400, dtype: float64

In [ ]:
file[["EstimatedSalary","Age"]]

     EstimatedSalary   Age
0            19000.0  19.0
1            20000.0  35.0
2            43000.0  26.0
3            57000.0  27.0
4            76000.0  19.0
..               ...   ...
395          41000.0  46.0
396          23000.0  51.0
397          20000.0  50.0
398          33000.0  36.0
399          36000.0  49.0

[400 rows x 2 columns]

In [ ]:
file1=file.dropna()
print(file1)

        User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510.0    Male  19.0          19000.0          0
3    15603246.0  Female  27.0          57000.0          0
6    15598044.0  Female  27.0          84000.0          0
8    15600575.0    Male  25.0          33000.0          0
11   15606274.0  Female  26.0          52000.0          0
..          ...     ...   ...              ...        ...
395  15691863.0  Female  46.0          41000.0          1
396  15706071.0    Male  51.0          23000.0          1
397  15654296.0  Female  50.0          20000.0          1
398  15755018.0    Male  36.0          33000.0          0
399  15594041.0  Female  49.0          36000.0          1

[377 rows x 5 columns]

In [ ]:
file1.to_csv("Preprocessed File.xslx")

In [ ]:
file1.to_csv("Preprocessed File.csv")